Revit 2027 API
CutLineType Enumeration
 The available line types for a stairs cut line.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CutLineType
Public Enumeration CutLineType
public enum class CutLineType
type CutLineType
Members
Member name | Value | Description
DoubleLine | 1 |  Cutline type is double-line.
SingleLine | 0 |  Cutline type is single-line.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace